**Plan Results**:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_instance.private_vm_0 will be created
+   resource "aws_instance" "private_vm_0" {
+       ami                                  = "ami-0cea098ed2ac54925"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = (known after apply)
+       availability_zone                    = "us-west-2b"
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = "private_vm_0"
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Name" = "private_vm_0"
        }
+       tags_all                             = {
+           "Name" = "private_vm_0"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       maintenance_options {
+           auto_recovery = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = (known after apply)
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = (known after apply)
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_card_index    = (known after apply)
+           network_interface_id  = (known after apply)
        }

+       private_dns_name_options {
+           enable_resource_name_dns_a_record    = (known after apply)
+           enable_resource_name_dns_aaaa_record = (known after apply)
+           hostname_type                        = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = true
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = 8
+           volume_type           = "gp2"
        }
    }

  # aws_instance.public_vm_0 will be created
+   resource "aws_instance" "public_vm_0" {
+       ami                                  = "ami-0cea098ed2ac54925"
+       arn                                  = (known after apply)
+       associate_public_ip_address          = true
+       availability_zone                    = "us-west-2a"
+       cpu_core_count                       = (known after apply)
+       cpu_threads_per_core                 = (known after apply)
+       disable_api_stop                     = (known after apply)
+       disable_api_termination              = (known after apply)
+       ebs_optimized                        = (known after apply)
+       get_password_data                    = false
+       host_id                              = (known after apply)
+       id                                   = (known after apply)
+       instance_initiated_shutdown_behavior = (known after apply)
+       instance_state                       = (known after apply)
+       instance_type                        = "t2.micro"
+       ipv6_address_count                   = (known after apply)
+       ipv6_addresses                       = (known after apply)
+       key_name                             = "public_vm_0"
+       monitoring                           = (known after apply)
+       outpost_arn                          = (known after apply)
+       password_data                        = (known after apply)
+       placement_group                      = (known after apply)
+       placement_partition_number           = (known after apply)
+       primary_network_interface_id         = (known after apply)
+       private_dns                          = (known after apply)
+       private_ip                           = (known after apply)
+       public_dns                           = (known after apply)
+       public_ip                            = (known after apply)
+       secondary_private_ips                = (known after apply)
+       security_groups                      = (known after apply)
+       source_dest_check                    = true
+       subnet_id                            = (known after apply)
+       tags                                 = {
+           "Name" = "public_vm_0"
        }
+       tags_all                             = {
+           "Name" = "public_vm_0"
        }
+       tenancy                              = (known after apply)
+       user_data                            = (known after apply)
+       user_data_base64                     = (known after apply)
+       user_data_replace_on_change          = false
+       vpc_security_group_ids               = (known after apply)

+       capacity_reservation_specification {
+           capacity_reservation_preference = (known after apply)

+           capacity_reservation_target {
+               capacity_reservation_id                 = (known after apply)
+               capacity_reservation_resource_group_arn = (known after apply)
            }
        }

+       ebs_block_device {
+           delete_on_termination = (known after apply)
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           snapshot_id           = (known after apply)
+           tags                  = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = (known after apply)
+           volume_type           = (known after apply)
        }

+       enclave_options {
+           enabled = (known after apply)
        }

+       ephemeral_block_device {
+           device_name  = (known after apply)
+           no_device    = (known after apply)
+           virtual_name = (known after apply)
        }

+       maintenance_options {
+           auto_recovery = (known after apply)
        }

+       metadata_options {
+           http_endpoint               = (known after apply)
+           http_put_response_hop_limit = (known after apply)
+           http_tokens                 = (known after apply)
+           instance_metadata_tags      = (known after apply)
        }

+       network_interface {
+           delete_on_termination = (known after apply)
+           device_index          = (known after apply)
+           network_card_index    = (known after apply)
+           network_interface_id  = (known after apply)
        }

+       private_dns_name_options {
+           enable_resource_name_dns_a_record    = (known after apply)
+           enable_resource_name_dns_aaaa_record = (known after apply)
+           hostname_type                        = (known after apply)
        }

+       root_block_device {
+           delete_on_termination = true
+           device_name           = (known after apply)
+           encrypted             = (known after apply)
+           iops                  = (known after apply)
+           kms_key_id            = (known after apply)
+           throughput            = (known after apply)
+           volume_id             = (known after apply)
+           volume_size           = 8
+           volume_type           = "gp2"
        }
    }

  # aws_internet_gateway.internet_gateway will be created
+   resource "aws_internet_gateway" "internet_gateway" {
+       arn      = (known after apply)
+       id       = (known after apply)
+       owner_id = (known after apply)
+       tags     = {
+           "Name" = "demo_internet_gateway"
        }
+       tags_all = {
+           "Name" = "demo_internet_gateway"
        }
+       vpc_id   = (known after apply)
    }

  # aws_key_pair.private_vm_0_key_pair will be created
+   resource "aws_key_pair" "private_vm_0_key_pair" {
+       arn             = (known after apply)
+       fingerprint     = (known after apply)
+       id              = (known after apply)
+       key_name        = "private_vm_0"
+       key_name_prefix = (known after apply)
+       key_pair_id     = (known after apply)
+       key_type        = (known after apply)
+       public_key      = (known after apply)
+       tags_all        = (known after apply)
    }

  # aws_key_pair.public_vm_0_key_pair will be created
+   resource "aws_key_pair" "public_vm_0_key_pair" {
+       arn             = (known after apply)
+       fingerprint     = (known after apply)
+       id              = (known after apply)
+       key_name        = "public_vm_0"
+       key_name_prefix = (known after apply)
+       key_pair_id     = (known after apply)
+       key_type        = (known after apply)
+       public_key      = (known after apply)
+       tags_all        = (known after apply)
    }

  # aws_route.route_public_internet will be created
+   resource "aws_route" "route_public_internet" {
+       destination_cidr_block = "0.0.0.0/0"
+       gateway_id             = (known after apply)
+       id                     = (known after apply)
+       instance_id            = (known after apply)
+       instance_owner_id      = (known after apply)
+       network_interface_id   = (known after apply)
+       origin                 = (known after apply)
+       route_table_id         = (known after apply)
+       state                  = (known after apply)
    }

  # aws_route_table.public_subnet_route_table will be created
+   resource "aws_route_table" "public_subnet_route_table" {
+       arn              = (known after apply)
+       id               = (known after apply)
+       owner_id         = (known after apply)
+       propagating_vgws = (known after apply)
+       route            = (known after apply)
+       tags             = {
+           "Name" = "demo_public_subnet_route_table"
        }
+       tags_all         = {
+           "Name" = "demo_public_subnet_route_table"
        }
+       vpc_id           = (known after apply)
    }

  # aws_route_table_association.internet_gateway_to_public_subnet_assoc will be created
+   resource "aws_route_table_association" "internet_gateway_to_public_subnet_assoc" {
+       id             = (known after apply)
+       route_table_id = (known after apply)
+       subnet_id      = (known after apply)
    }

  # aws_security_group.db_tier_security_group will be created
+   resource "aws_security_group" "db_tier_security_group" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "db_tier_security_group"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "db_tier_security_group"
        }
+       tags_all               = {
+           "Name" = "db_tier_security_group"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group.web_dmz_security_group will be created
+   resource "aws_security_group" "web_dmz_security_group" {
+       arn                    = (known after apply)
+       description            = "Managed by Terraform"
+       egress                 = (known after apply)
+       id                     = (known after apply)
+       ingress                = (known after apply)
+       name                   = "web_dmz_security_group"
+       name_prefix            = (known after apply)
+       owner_id               = (known after apply)
+       revoke_rules_on_delete = false
+       tags                   = {
+           "Name" = "web_dmz_security_group"
        }
+       tags_all               = {
+           "Name" = "web_dmz_security_group"
        }
+       vpc_id                 = (known after apply)
    }

  # aws_security_group_rule.adb_tier_llow_outbound_internet will be created
+   resource "aws_security_group_rule" "adb_tier_llow_outbound_internet" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Egress to public internet."
+       from_port                = 0
+       id                       = (known after apply)
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 65535
+       type                     = "egress"
    }

  # aws_security_group_rule.all_icmp_v4 will be created
+   resource "aws_security_group_rule" "all_icmp_v4" {
+       cidr_blocks              = [
+           "10.0.1.0/24",
        ]
+       description              = "All ICMP v4"
+       from_port                = -1
+       id                       = (known after apply)
+       protocol                 = "icmp"
+       security_group_id        = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = -1
+       type                     = "ingress"
    }

  # aws_security_group_rule.allow_22 will be created
+   resource "aws_security_group_rule" "allow_22" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Ingress on port 22."
+       from_port                = 22
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 22
+       type                     = "ingress"
    }

  # aws_security_group_rule.allow_3306 will be created
+   resource "aws_security_group_rule" "allow_3306" {
+       cidr_blocks              = [
+           "10.0.1.0/24",
        ]
+       description              = "Ingress on port 3306."
+       from_port                = 3306
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 3306
+       type                     = "ingress"
    }

  # aws_security_group_rule.allow_443 will be created
+   resource "aws_security_group_rule" "allow_443" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Ingress on port 443."
+       from_port                = 443
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 443
+       type                     = "ingress"
    }

  # aws_security_group_rule.allow_80 will be created
+   resource "aws_security_group_rule" "allow_80" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Ingress on port 80."
+       from_port                = 80
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 80
+       type                     = "ingress"
    }

  # aws_security_group_rule.allow_outbound_internet will be created
+   resource "aws_security_group_rule" "allow_outbound_internet" {
+       cidr_blocks              = [
+           "0.0.0.0/0",
        ]
+       description              = "Egress to public internet."
+       from_port                = 0
+       id                       = (known after apply)
+       protocol                 = "-1"
+       security_group_id        = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 65535
+       type                     = "egress"
    }

  # aws_security_group_rule.db_tier_allow_22 will be created
+   resource "aws_security_group_rule" "db_tier_allow_22" {
+       cidr_blocks              = [
+           "10.0.1.0/24",
        ]
+       description              = "Ingress on port 22."
+       from_port                = 22
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 22
+       type                     = "ingress"
    }

  # aws_security_group_rule.db_tier_allow_80 will be created
+   resource "aws_security_group_rule" "db_tier_allow_80" {
+       cidr_blocks              = [
+           "10.0.1.0/24",
        ]
+       description              = "Ingress on port 80."
+       from_port                = 80
+       id                       = (known after apply)
+       protocol                 = "tcp"
+       security_group_id        = (known after apply)
+       self                     = false
+       source_security_group_id = (known after apply)
+       to_port                  = 80
+       type                     = "ingress"
    }

  # aws_subnet.private_subnet will be created
+   resource "aws_subnet" "private_subnet" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-west-2b"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.2.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = false
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "10.0.2.0/24_us-west-2b"
        }
+       tags_all                                       = {
+           "Name" = "10.0.2.0/24_us-west-2b"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_subnet.public_subnet will be created
+   resource "aws_subnet" "public_subnet" {
+       arn                                            = (known after apply)
+       assign_ipv6_address_on_creation                = false
+       availability_zone                              = "us-west-2a"
+       availability_zone_id                           = (known after apply)
+       cidr_block                                     = "10.0.1.0/24"
+       enable_dns64                                   = false
+       enable_resource_name_dns_a_record_on_launch    = false
+       enable_resource_name_dns_aaaa_record_on_launch = false
+       id                                             = (known after apply)
+       ipv6_cidr_block_association_id                 = (known after apply)
+       ipv6_native                                    = false
+       map_public_ip_on_launch                        = true
+       owner_id                                       = (known after apply)
+       private_dns_hostname_type_on_launch            = (known after apply)
+       tags                                           = {
+           "Name" = "10.0.1.0/24_us-west-2a"
        }
+       tags_all                                       = {
+           "Name" = "10.0.1.0/24_us-west-2a"
        }
+       vpc_id                                         = (known after apply)
    }

  # aws_vpc.main will be created
+   resource "aws_vpc" "main" {
+       arn                                  = (known after apply)
+       cidr_block                           = "10.0.0.0/16"
+       default_network_acl_id               = (known after apply)
+       default_route_table_id               = (known after apply)
+       default_security_group_id            = (known after apply)
+       dhcp_options_id                      = (known after apply)
+       enable_classiclink                   = (known after apply)
+       enable_classiclink_dns_support       = (known after apply)
+       enable_dns_hostnames                 = (known after apply)
+       enable_dns_support                   = true
+       id                                   = (known after apply)
+       instance_tenancy                     = "default"
+       ipv6_association_id                  = (known after apply)
+       ipv6_cidr_block                      = (known after apply)
+       ipv6_cidr_block_network_border_group = (known after apply)
+       main_route_table_id                  = (known after apply)
+       owner_id                             = (known after apply)
+       tags                                 = {
+           "Name" = "demo_vpc"
        }
+       tags_all                             = {
+           "Name" = "demo_vpc"
        }
    }

  # tls_private_key.public_vm_0 will be created
+   resource "tls_private_key" "public_vm_0" {
+       algorithm                     = "RSA"
+       ecdsa_curve                   = "P224"
+       id                            = (known after apply)
+       private_key_openssh           = (sensitive value)
+       private_key_pem               = (sensitive value)
+       private_key_pem_pkcs8         = (sensitive value)
+       public_key_fingerprint_md5    = (known after apply)
+       public_key_fingerprint_sha256 = (known after apply)
+       public_key_openssh            = (known after apply)
+       public_key_pem                = (known after apply)
+       rsa_bits                      = 4096
    }

Plan: 23 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   private_key_pem = (sensitive value)
+   private_vm_0_ip = (known after apply)
+   public_key_pem  = (known after apply)
+   public_vm_0_ip  = (known after apply)
+   ssh_private_key = (sensitive value)
+   ssh_public_key  = (known after apply)
```